Documents/абс_ПланСкладскогоОстатка/абс_ПланСкладскогоОстатка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПланСкладскогоОстатка</name>
  <registerRecords>InformationRegister.абс_ПрогнозСкладскогоОстатка</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПрогноза18</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПланаПроизводства</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПрогнозаСкладскогоОстатка</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтраховойЗапас</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Дней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладскиеОстатки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланПродаж</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МодельСкладскогоОстатка</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрогнозСкладскогоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрогнозПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УровеньНеснижаемогоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланПроизводства</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ПланСкладскогоОстатка/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	Отказ=Ложь;
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) или Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Не заполнен период!";
		Сообщение.Сообщить();
		Отказ=Истина;
	КонецЕсли;
	Если Объект.СценарийПрогноза18.Пустая() Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Не заполнен сценарий планирования!";
		Сообщение.Сообщить();
		Отказ=Истина;
	КонецЕсли;
	Если Объект.Склады.Количество()=0 Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Не выбраны склады!";
		Сообщение.Сообщить();
		Отказ=Истина;
 	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Объект.СтраховойЗапас.Количество()>0 или Объект.СкладскиеОстатки.Количество()>0 Тогда
		Если Вопрос("Перед заполнением данные будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.СтраховойЗапас.Очистить();
			Объект.СкладскиеОстатки.Очистить();
			Объект.Заказы.Очистить();
			Объект.ПланПродаж.Очистить();
			Объект.МодельСкладскогоОстатка.Очистить();
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьСервер();
	Этаформа.ТекущийЭлемент=ЭтаФорма.Элементы.ГруппаПланПродаж;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьДанныеДляРасчета(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед расчетом необходимо записать документ. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЭтаФорма.Записать();
		КонецЕСли;
	КонецЕсли;
	РассчитатьСервер();
	ЭтаФорма.ОбновитьОтображениеДанных();
	Этаформа.ТекущийЭлемент=ЭтаФорма.Элементы.ГруппаМодельСкладскогоОстатка;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаСервере
Процедура РассчитатьСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.РассчитатьМодельСкладскогоОстатка(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзТаблицы(Команда)
	Если Параметры.Ключ.Пустая() Тогда
		Сообщить("Сначала запишите документ!");
		Возврат;
	КонецЕсли; 
	СтруктураПараметров = Новый Структура("Ключ", Объект.Ссылка);
	ФормаЗагрузки = ПолучитьФорму("Документ.абс_ПланСкладскогоОстатка.Форма.ФормаЗагрузки", СтруктураПараметров, Объект.Ссылка);
	ФормаЗагрузки.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "абс_ПланСкладскогоОстатка_ЗагрузкаИзEXCEL" Тогда
		Если Объект.МодельСкладскогоОстатка.Количество() > 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "Заменить данные в документе?";
			Ответ = Вопрос(Текст, Режим, 0);    
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.МодельСкладскогоОстатка.Очистить();			
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьТЧДокументаПоТаблицеСервер(Параметр); 
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Попытка
		ЭтотОбъект.ЗаполнитьТЧДокументаПоТаблице(ЭтотОбъект, ТабДок);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Некорректный формат таблицы загрузки: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Диалог.ВыбранныеФайлы[0];
	
	Если Объект.МодельСкладскогоОстатка.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Заменить данные в документе?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.МодельСкладскогоОстатка.Очистить();			
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВнешнийФайл 	= Новый ДвоичныеДанные(ПутьКФайлу);
	
	АдресФайлаВХранилище = "";
	
	Если ПоместитьВоВременноеХранилище(ВнешнийФайл, АдресФайлаВХранилище) Тогда
	
		ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище);
		
	Иначе
		
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер!");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище)
	
	ТабДок = абс_РаботаСФайлами.ПолучитьТабличныйДокументПоФайлуExcel(АдресФайлаВХранилище);
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок);
	
КонецПроцедуры
